Emacs.org
#+title: Emacs Configuration
#+PROPERTY: header-args:elisp :tangle ~/.dotfiles/.files/init.el

* Package System Setup
Set up package archives.

#+begin_src elisp
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                             ("org" . "https://orgmode.org/elpa/")
                             ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src

Install =use-package=.

#+begin_src  elisp
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

* General Configuration
** User Interface

#+begin_src elisp 

  (setq inhibit-splash-screen t)   ;; Don't show startup message
  (scroll-bar-mode -1)	       ;; Disable visible scrollbar
  (tool-bar-mode -1)	       ;; Disable the toolbar
  (tooltip-mode -1)	               ;; Disable tooltips
  (set-fringe-mode 10)	       ;; Give some breathing room
  (menu-bar-mode -1)	       ;; Disable the menu bar
  (blink-cursor-mode 1)	       ;; Blink cursor
  (setq mouse-autoselect-window t)

  ;;(setq visible-bell t)          ;; Set up the visual bell
#+end_src

** Column and Line Numbers

#+begin_src elisp
  (column-number-mode)                 ;; show column number in the mode-line
  (global-display-line-numbers-mode t) ;; enable line numbers

  (dolist (mode '(org-mode-hook
                  dired-mode-hook
                  shell-mode-hook
                  term-mode-hook
                  tetris-mode-hook
                  Man-mode-hook
                  Man-mode-hook
                  inferior-haskell-mode
                  helpful-mode-hook
                  mu4e-main-mode-hook
                  doc-view-mode-hook
                  calendar-mode-hook
                  inferior-octave-mode-hook
                  vterm-mode-hook
                  elfeed-search-mode-hook
                  elfeed-show-mode-hook
                  eshell-mode-hook))
      (add-hook mode (lambda() (display-line-numbers-mode 0))))
#+end_src

** Windows Mannagement
*** winner-mode

#+begin_src elisp
  (use-package winner-mode
    :ensure nil
    :init
    (winner-mode)
    :bind(:map evil-window-map
               ("u" . winner-undo)
               ("U" . winner-redo)))
#+end_src

*** Key-bindings

#+begin_src elisp
  (global-set-key (kbd "C-x p") 'previous-window-any-frame)
#+end_src

** Buffer Mannagement
*** Key bindings

#+begin_src elisp
  (global-unset-key (kbd "C-x ["))
  (global-unset-key (kbd "C-x ]"))
  (global-unset-key (kbd "C-x C-b"))

  (global-set-key (kbd "C-x [") 'previous-buffer)
  (global-set-key (kbd "C-x ]") 'next-buffer)
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src

** Auto-revert mode

#+begin_src elisp
(global-auto-revert-mode 1)
#+end_src

** Fonts

#+begin_src elisp
  (set-face-attribute 'default nil
                      :font "JetBrains Mono"
                      :height 105
                      :weight 'normal)

  ;; Set fixed pitch face
  (set-face-attribute 'fixed-pitch nil
                      :font "JetBrains Mono"
                      :height 105)

  ;; Set variable pitch face
  ;;(set-face-attribute 'variable-pitch nil
                      ;;:font "Cantarell"
                      ;;:height 135
                      ;;:weight 'regular)

#+end_src

*** Emoji

#+begin_src elisp
(use-package emojify)
#+end_src

** Mode-Line

#+begin_src elisp
   (use-package all-the-icons)

   (use-package doom-modeline
     :after all-the-icons
     :init
     (doom-modeline-mode 1))
   (setq doom-modeline-height 40)
#+end_src

** Theme

#+begin_src elisp
  (use-package doom-themes
    :init (load-theme 'doom-solarized-dark t))
#+end_src

* Registers
** Directories

#+begin_src elisp
  (setq code-directory "/home/gabriel/Code/")
  (setq config-directory "/home/gabriel/.dotfiles/")
  (setq semestre-file "/home/gabriel/Notes/UnB/2021-01/2021-01.org")
#+end_src

** Keys

#+begin_src elisp
  (set-register ?p (cons 'file (concat code-directory "PC/test.cpp")))
  (set-register ?c (cons 'file code-directory))
  (set-register ?d (cons 'file config-directory))
  (set-register ?u (cons 'file semestre-file))
#+end_src

* Undo-tree

#+begin_src elisp
  (use-package undo-tree
    :config
    (global-undo-tree-mode 1))
#+end_src

* Keyboard Bindings
** ESC quit prompts

#+begin_src elisp
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** which-key

#+begin_src elisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))
#+end_src

** Evil

#+begin_src elisp
  (defun gscn/evil-hook ()
    (dolist (mode '(shell-mode eshell-mode vterm-mode))
            (add-to-list 'evil-emacs-state-modes mode)))

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil) ;; necessary to use evil collection
    (evil-mode 1)
    :hook (evil-mode . gscn/evil-hook)
    :config
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-undo-system 'undo-tree)) 

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

*NOTE*: You can use ~C-z~ to alternate between evil mode and emacs mode.

* Completion
** Ivy

#+begin_src elisp
(use-package ivy
  :diminish ;; dont show minor mode in the bar

  :init (ivy-mode 1)
  :bind (;;("C-s" . swiper) ;; have to install swiper
	 :map ivy-minibuffer-map
	 ("TAB" . ivy-alt-done)
	 ("C-l" . ivy-alt-done)
	 ("C-j" . ivy-next-line)
	 ("C-k" . ivy-previous-line)
	 :map ivy-switch-buffer-map
	 ("C-k" . ivy-previous-line)
	 ("C-l" . ivy-done)
	 ("C-d" . ivy-switch-buffer-kill)
	 :map ivy-reverse-i-search-map
	 ("C-k" . ivy-previous-line)
	 ("C-d" . ivy-reverse-i-search-kill)))
#+end_src

** Counsel

#+begin_src elisp
(use-package counsel
  :bind (("M-x" . counsel-M-x)
	 ("C-x b" . counsel-ibuffer)
	 ("C-x C-f" . counsel-find-file)
	 ("C-x C-r" . counsel-buffer-or-recentf)
	 ("C-M-j" . counsel-switch-buffer)
	 :map minibuffer-local-map
	 ("C-r" . counsel-minibuffer-history))
  :config
  (setq ivy-initial-inputs-alist nil) ;; Don't start searches with ^
  (recentf-mode 1)) ;; Don't start searches with ^
#+end_src

*NOTE*: ~M-o~ shows prompt options
** Ivy rich

#+begin_src elisp
(use-package ivy-rich
  :init
  (ivy-rich-mode 1))
#+end_src

* Languages
** Language Server Protocol

#+begin_src elisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'at-point))
#+end_src

** General
*** Rainbow Delimiters 

#+begin_src elisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** Smartparens

#+begin_src elisp
  (use-package smartparens
    :hook ((prog-mode . smartparens-mode)
           (prog-mode . show-smartparens-mode)))
#+end_src

*** Evil Nerd Commenter

#+begin_src elisp
  (use-package evil-nerd-commenter
    :config
    (evilnc-default-hotkeys))
#+end_src

*** Evil Surround

#+begin_src elisp
(use-package evil-surround
  :config
  (global-evil-surround-mode 1))
 #+end_src

*** Tab

#+begin_src elisp
  (setq-default tab-width 4)
  (setq-default evil-shift-width 4)
#+end_src

** C++

#+begin_src elisp
  (setq lsp-clients-clangd-args '("--header-insertion-decorators=0" "--header-insertion=never"))
  (add-hook 'c++-mode-hook 'lsp-deferred)
#+end_src

** CSV

#+begin_src elisp
  (use-package csv-mode)
#+end_src

** Emacs Lisp

#+begin_src elisp
(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src

** Go

#+begin_src elisp
(use-package go-mode)
#+end_src

** Haskell

#+begin_src elisp
  (use-package haskell-mode)
#+end_src

** R

#+begin_src elisp
  (use-package ess)
#+end_src

** TypeScript

#+begin_src elisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))
#+end_src

** Vim Script

#+begin_src elisp
  (use-package vimrc-mode)
#+end_src

** Octave

#+begin_src elisp


  (setq auto-mode-alist
		  (cons '("\\.m$" . octave-mode) auto-mode-alist))

  (add-hook 'octave-mode-hook
			(lambda ()
			  (abbrev-mode 1)
			  (auto-fill-mode 1)
			  (if (eq window-system 'x)
				  (font-lock-mode 1))))

  ;; (use-package octave-mode
  ;;   :ensure nil
  ;;   :bind(
  ;; 		:map octave-mode-map
  ;; 			 ("<C-return>" . octave-send-line)
  ;; 			 ))

  (require 'octave)
  (define-key octave-mode-map (kbd "<C-return>") 'octave-send-line)



#+end_src

