Emacs.org
* Company Mode

#+begin_src elisp
  (use-package company
    :after lsp-mode
    :hook (prog-mode . company-mode)
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0)
    (company-format-margin-function 'company-vscode-dark-icons-margin))

#+end_src

* Projectile

#+begin_src elisp
  (use-package projectile
    :config
    (projectile-mode)
    (setq projectile-switch-project-action 'projectile-dired)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (setq projectile-project-search-path '("~/Code/UnB/" "~/.dotfiles/")))

#+end_src

* Hydra

#+begin_src elisp
(use-package hydra)
#+end_src

* Git
** Magit

#+begin_src elisp
  (use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

** TODO Forge

Package for integration between github and Magit

* Productivity
** Calendar

#+begin_src elisp
(setq calendar-date-style 'european)
#+end_src

** Perspective

#+begin_src elisp
  (use-package perspective
    :bind (("C-x k" . persp-kill-buffer*))
    :init
    (persp-mode))
#+end_src

* Unix
** Man
#+begin_src elisp
(setq Man-notify-method 'aggressive)
#+end_src

* YASnippet

#+begin_src elisp
  (use-package yasnippet
    :config
    (yas-global-mode 1))

#+end_src

* Org Mode
** Icons

#+begin_src elisp
  (defun org-icons ()
     "Beautify org mode keywords."
     (interactive)
     (setq prettify-symbols-alist '(("[ ]" . "")
                                    ("[X]" . "")
                                    ))
     (prettify-symbols-mode))
#+end_src

** Org Configurations

#+begin_src elisp
  (defun gscn/org-mode-setup()
    (org-indent-mode)
    (org-icons)
    (visual-line-mode 1)) 

  (use-package org
    :hook ((org-mode . gscn/org-mode-setup)
           (org-mode . org-toggle-pretty-entities))
    :config
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers t
          org-startup-folded t
          org-directory "~/Notes")

    (setq org-list-demote-modify-bullet
          '(("+" . "-") ("-" . "+") ("*" . "-"))))

  (require 'org-faces)

  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.0)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)))
    (set-face-attribute (car face) nil :height (cdr face)))


  (set-face-attribute 'org-document-title nil :height 1.5 :foreground "#b58900")
#+end_src

** Bullets

#+begin_src elisp
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

** Visual fill column

#+begin_src elisp
  ;;(defun gscn/org-mode-visual-fill ()
    ;;(setq visual-fill-column-width 100
          ;;visual-fill-column-center-text t)
    ;;(visual-fill-column-mode 1))
;;
  ;;(use-package visual-fill-column
    ;;:hook (org-mode . gscn/org-mode-visual-fill))
#+end_src
 
** Org Babel

#+begin_src elisp
  (org-babel-do-load-languages
   'org-babel-load-languages '(
                               (emacs-lisp . t)
                               (C . t)
                               (python . t)
                               (shell . t)
                               (js     . t)
                               (haskell . t)))

  (setq org-confirm-babel-evaluate nil) ;; não pergunta se vc quer validar
  (setq org-src-window-setup 'current-window)
#+end_src

** Structure Templates

#+begin_src elisp
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src elisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("cpp" . "src cpp"))
  (add-to-list 'org-structure-template-alist '("hs" . "src haskell"))
  (add-to-list 'org-structure-template-alist '("js" . "src js :results output"))
#+end_src

** Auto-tangle Configuration Files

#+begin_src elisp

  (defun gscn/org-babel-tangle-config ()
    (when (string-match

           (expand-file-name "~/.dotfiles/.*\.org$")
           (buffer-file-name))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))


  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'gscn/org-babel-tangle-config)))

#+end_src

** Org Roam

#+begin_src elisp
  (use-package org-roam
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Notes")
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c f" . org-roam-node-find)
           ("C-c i" . org-roam-node-insert)
           )
    :config
    (org-roam-setup)
    )
#+end_src

* Terminals
** term-mode

#+begin_src elisp
  (use-package term
    :config
    (setq explicit-shell-file-name "zsh")
    (setq term-prompt-regexp "^[^#$%>\\n]*[#$%>] *"))

#+end_src

- ~C-c C-p~ / ~C-c C-n~ - go back and forward in the buffer's prompts (also =[[= and =]]= with wvil mode)
- You can use ~C-c C-k~ to enable =char-mode=, and ~C-c C-j~ to get back to =line-mode=
- If you have =evil-collection= installed, =term-mode= will enter char mode when you use Evil's Insert mode
- Caveat - editing the input line with Evil motions doesn't work

*** For better color support

Make sure the =tic= program is available on your machine (could be part of =ncurses= package).

#+begin_src elisp
  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))
#+end_src

*** ans-term

=ansi-term= is a specialization of =term-mode=

Minor differences:
- Buffers are managed slightly differently
** vterm (emacs-libvterm)

NOTE: This one needs to compile a native library, make sure to install its dependencies.

Diferences to =term=:

- Written in native code, much faster and better emulation
- There is no =line-mode= / =char-mode= split
*** General Configuration

#+begin_src elisp
    (use-package vterm
      :commands vterm
      :bind ("C-c t" . vterm-other-window)
      :config
      (setq vterm-max-scrollback 10000)
      (evil-set-initial-state 'vterm-mode 'emacs)
  )
#+end_src  

- Read docs on =vterm-use-vterm-prompt-detection-method= for prompt detection
*** Toggle

#+begin_src elisp
      (use-package vterm-toggle
        :bind (
               ("C-;" . vterm-toggle))
        :config
        (setq vterm-toggle-hide-method 'reset-window-configration)
        (setq vterm-toggle-reset-window-configration-after-exit t)
        (setq vterm-toggle-fullscreen-p nil)
  (add-to-list 'display-buffer-alist
        '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
           (display-buffer-reuse-window display-buffer-same-window)))
  )
#+end_src

** shell-mode

Runs a shell program on your computer in a more controlled buffer. Does not operate as a terminal emulator.

- ~C-c C-p~ / ~C-c C-n~ - go back and forward in the buffer's prompts
- ~M-p~ / ~M-n~ - go back and forward in the input history
- ~C-c C-u~ - delete the current input string backwards up to the cursor
- =counsel-shell-history= - A searchable history of commands typed into the shell

** Eshell
*** General Configuration

#+begin_src elisp

  (defun gscn/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;;Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) ehsell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) ehsell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size         10000
          ehsell-buffer-maximum-lines 10000
          eshell-hist-ignoredups      t))

  (use-package eshell-git-prompt)

  (use-package eshell
    :hook (eshell-first-time-mode . gscn/configure-eshell)
    :config
    (setq eshell-mode-map (make-sparse-keymap))
    (eshell-git-prompt-use-theme 'git-radar))
#+end_src

*** Aliases

#+begin_src elisp
  (defun eshell/ff (&rest args)
    (apply #'find-file args))

  (defun eshell/cl ()
    (eshell/clear 1))

  (defun eshell/gg (&rest args)
    (shell-command-to-string "ls"))
#+end_src

*** Syntax Highlighting

#+begin_src elisp
  (use-package eshell-syntax-highlighting
    :after esh-mode
    :config
    ;; Enable in all Eshell buffers.
    (eshell-syntax-highlighting-global-mode +1))
#+end_src

*** Toggle eshell

#+begin_src elisp
  (use-package eshell-toggle
    :bind ("C-:" . eshell-toggle))
#+end_src

* Dired
** Configuration 

- =dired-listing-switches=: Try =-agho --group-directories-first=
- ~g~ / ~g r~ Refresh the buffer with =revert-buffer= after changing configuration (and after filesystem changes)
  
#+begin_src elisp
  (defun dired-videos ()
    (interactive)
    (dired-single-buffer "~/Videos/"))

  (use-package dired-single)
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom
    ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer
      "b" 'dired-videos
      ))

  (use-package all-the-icons-dired
    :hook (dired-mode .  all-the-icons-dired-mode))
#+end_src

** File Operations
