.files/init.el

(use-package company
  :after lsp-mode
  :hook (prog-mode . company-mode)
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0)
  (company-format-margin-function 'company-vscode-dark-icons-margin))

(use-package projectile
  :config
  (projectile-mode)
  (setq projectile-switch-project-action 'projectile-dired)
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (setq projectile-project-search-path '("~/Code/UnB/" "~/.dotfiles/")))

(use-package hydra)

(use-package magit
:custom
(magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(setq calendar-date-style 'european)

(use-package perspective
  :bind (("C-x k" . persp-kill-buffer*))
  :init
  (persp-mode))

(use-package crux
  :bind (
         ("C-x 4 -" . crux-transpose-windows)))

(setq Man-notify-method 'aggressive)

(use-package yasnippet
  :config
  (yas-global-mode 1))

(defun org-icons ()
   "Beautify org mode keywords."
   (interactive)
   (setq prettify-symbols-alist '(("[ ]" . "")
                                  ("[X]" . "")
                                  ))
   (prettify-symbols-mode))

(defun gscn/org-mode-setup()
  (org-indent-mode)
  (org-icons)
  (visual-line-mode 1)) 

(use-package org
  :hook ((org-mode . gscn/org-mode-setup)
         (org-mode . org-toggle-pretty-entities))
  :config
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t
        org-startup-folded t
        org-directory "~/Notes")

  (setq org-list-demote-modify-bullet
        '(("+" . "-") ("-" . "+") ("*" . "-"))))

(require 'org-faces)

(dolist (face '((org-level-1 . 1.2)
                (org-level-2 . 1.1)
                (org-level-3 . 1.0)
                (org-level-4 . 1.0)
                (org-level-5 . 1.0)
                (org-level-6 . 1.0)
                (org-level-7 . 1.0)))
  (set-face-attribute (car face) nil :height (cdr face)))


(set-face-attribute 'org-document-title nil :height 1.5 :foreground "#b58900")

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(setq org-clock-sound  "~/.config/sounds/pop.wav")
(setq org-show-notification-timeout 1)

;;(defun gscn/org-mode-visual-fill ()
    ;;(setq visual-fill-column-width 100
          ;;visual-fill-column-center-text t)
    ;;(visual-fill-column-mode 1))
;;
  ;;(use-package visual-fill-column
    ;;:hook (org-mode . gscn/org-mode-visual-fill))

(org-babel-do-load-languages
 'org-babel-load-languages '(
                             (emacs-lisp . t)
                             (C . t)
                             (python . t)
                             (shell . t)
                             (js     . t)
                             (haskell . t)))

(setq org-confirm-babel-evaluate nil) ;; não pergunta se vc quer validar
(setq org-src-window-setup 'current-window)

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src elisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("cpp" . "src cpp"))
(add-to-list 'org-structure-template-alist '("hs" . "src haskell"))
(add-to-list 'org-structure-template-alist '("js" . "src js :results output"))

(defun gscn/org-babel-tangle-config ()
  (when (string-match

         (expand-file-name "~/.dotfiles/.*\.org$")
         (buffer-file-name))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))


(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'gscn/org-babel-tangle-config)))

(use-package org-roam
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/Notes")
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c f" . org-roam-node-find)
         ("C-c i" . org-roam-node-insert)
         )
  :config
  (org-roam-setup)
  )

(use-package term
  :config
  (setq explicit-shell-file-name "zsh")
  (setq term-prompt-regexp "^[^#$%>\\n]*[#$%>] *"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(use-package vterm
    :commands vterm
    :bind ("C-c t" . vterm-other-window)
    :config
    (setq vterm-max-scrollback 10000)
    (evil-set-initial-state 'vterm-mode 'emacs)
)

(use-package vterm-toggle
      :bind (
             ("C-;" . vterm-toggle))
      :config
      (setq vterm-toggle-hide-method 'reset-window-configration)
      (setq vterm-toggle-reset-window-configration-after-exit t)
      (setq vterm-toggle-fullscreen-p nil)
(add-to-list 'display-buffer-alist
      '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
         (display-buffer-reuse-window display-buffer-same-window)))
)

(defun gscn/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;;Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) ehsell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) ehsell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        ehsell-buffer-maximum-lines 10000
        eshell-hist-ignoredups      t))

(use-package eshell-git-prompt)

(use-package eshell
  :hook (eshell-first-time-mode . gscn/configure-eshell)
  :config
  (setq eshell-mode-map (make-sparse-keymap))
  (eshell-git-prompt-use-theme 'git-radar))

(defun eshell/ff (&rest args)
  (apply #'find-file args))

(defun eshell/cl ()
  (eshell/clear 1))

(defun eshell/gg (&rest args)
  (shell-command-to-string "ls"))

(use-package eshell-syntax-highlighting
  :after esh-mode
  :config
  ;; Enable in all Eshell buffers.
  (eshell-syntax-highlighting-global-mode +1))

(use-package eshell-toggle
  :bind ("C-:" . eshell-toggle))

(defun dired-videos ()
  (interactive)
  (dired-single-buffer "~/Videos/"))

(use-package dired-single)
(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom
  ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer
    "b" 'dired-videos
    ))

(use-package all-the-icons-dired
  :hook (dired-mode .  all-the-icons-dired-mode))
