.files/init.el

(use-package dired-open
  :config
  (setq dired-open-extensions '(("png" . "sxiv")
                                ("mp4" . "mpv")
                                ("mkv" . "mpv"))))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

(defun gscn/lookup-password(&rest keys)
  (let ((result (apply #'auth-source-search keys)))
    (if result
      (funcall (plist-get (car result) :secret))
      nil)))

(use-package mu4e
  :ensure nil
  :defer 20 ;; Wait until 20 seconds after startup
  :load-path "/usr/share/emacs/site-lisp/mu4e/"

  :bind (:map global-map
              ("C-c m " . mu4e))
  :config

  ;; This is set to 't' to avoid mail syncing isses when using mbsync
  (setq mu4e-change-filenames-when-moving t)

  ;; Refresh mail using isync every 10 minutes
  (setq mu4e-update-interval (* 10 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/Documents/Mail")
  (setq mu4e-compose-format-flowed t) ;; Text will be adapted to screen size 
  (setq mu4e-compose-signature "Att.\nGabriel S. C. Nogueira") ;; Text will be adapted to screen size 

  (setq user-mail-address "gab.nog94@gmail.com")
  (setq user-full-name "Gabriel da Silva Corvino Nogueira")
  (setq mu4e-drafts-folder "/[Gmail]/Rascunhos")
  (setq mu4e-sent-folder "/[Gmail]/E-mails enviados")
  (setq mu4e-refile-folder "/[Gmail]/Todos os e-mails")
  (setq mu4e-trash-folder "/[Gmail]/Lixeira")
  (setq smtpmail-smtp-server "smtp.gmail.com")
  (setq smtpmail-smtp-service 465)
  (setq smtpmail-stream-type 'ssl)
  (setq message-send-mail-function 'smtpmail-send-it)

  (setq mu4e-maildir-shortcuts
        '(("/Inbox"                    . ?i)
          ("/[Gmail]/E-mails enviados" . ?e)
          ("/[Gmail]/Lixeira"          . ?l)
          ("/[Gmail]/Rascunhos"        . ?r)
          ("/[Gmail]/Todos os e-mails" . ?t)))

  ( setq mu4e-bookmarks 
   '((:name "Unread messages" :query "flag:unread AND NOT flag:trashed" :key 117)
     (:name "Inbox" :query "maildir:/Inbox" :key ?i)
     (:name "Today's messages" :query "date:today..now" :key 116)
     (:name "Last 7 days" :query "date:7d..now" :hide-unread t :key 119)
     (:name "Messages with images" :query "mime:image/*" :key 112))
   )
  (mu4e t))

(defun gscn/elfeed-setup ()
    (( elfed-search-set-filter "@6-months-ago")
     ))
  (use-package elfeed
    :bind (:map global-map
            ("C-c e " . elfeed))
    :config
    (setq elfeed-feeds '(
                          ("https://feeds.feedburner.com/diolinux ")
                          ("https://itsfoss.com/feed/")
                          ("https://lukesmith.xyz/rss.xml")
                          ("https://noticias.unb.br/?format=feed&type=rss")
                          ("https://cic.unb.br/feed/")
                          ("https://decrepitos.com/podcast/feed.xml")
                          ("https://notrelated.libsyn.com/rss")
                          ("https://anchor.fm/s/14298150/podcast/rss")
                          ("https://www.youtube.com/feeds/videos.xml?channel_id=UCld68syR8Wi-GY_n4CaoJGA")
                          ("https://www.youtube.com/feeds/videos.xml?channel_id=UCEf5U1dB5a2e2S-XUlnhxSA")
                          ("https://www.youtube.com/feeds/videos.xml?channel_id=UCVls1GmFKf6WlTraIb_IaJg")
                          ("https://www.youtube.com/feeds/videos.xml?channel_id=UC2eYFnH61tmytImy1mTYvhA")
                          ("https://www.youtube.com/feeds/videos.xml?channel_id=UCsnGwSIHyoYN0kiINAGUKxg")
                          ("https://github.com/dracula/dracula-theme/commits/master.atom")
                          ("https://github.com/UnBalloon/aulas-avancadas/commits/main.atom")
                          ("https://www.archlinux.org/feeds/news/")
                          ("https://suckless.org/atom.xml")
                          ("https://emacsredux.com/atom.xml")
                          ("https://www.reddit.com/r/emacs.rss")


                          ))
    (advice-add 'elfeed :after 'elfeed-update)
)

(defun gscn/set-font-faces()
  (message "Setting faces!")
  (set-face-attribute 'default nil :font "JetBrains Mono" :height 105 :weight 'regular))

(if (daemonp)
    (add-hook 'after-make-frame-functions
	      (lambda(frame)
		(setq doom-modeline-icon t)
		(with-selected-frame frame
		  (gscn/set-font-faces))))
 (gscn/set-font-faces))
